

    const hundreds = [
        "",
        "сто",
        "двісті",
        "триста",
        "чотириста",
        "п'ятсот",
        "шістсот",
        "сімсот",
        "вісімсот",
        "дев'ятсот",
      ];
      
    const dozens = [
        "",
        "",
        "двадцять",
        "тридцять",
        "сорок",
        "п'ядесят",
        "шісдесят",
        "сімдесят",
        "вісімдесят",
        "дев'яносто",
      ];

    const units = [
        "",
        "одна",
        "дві",
        "три",
        "чотири",
        "п'ять",
        "шість",
        "сім",
        "вісім",
        "дев'ять",
        "десять",
        "одинадцять",
        "дванадцять",
        "тринадцять",
        "чотирнадцять",
        "п'ятнадцять",
        "шістнадцять",
        "сімнадцять",
        "вісімнадцять",
        "дев'ятнадцять",
      ];

    let input = 617; //Входное число

    input = [...input.toString()];

    for(let i = 0; i < input.length; i++){
        input[i] = +input[i];
    }    

    if(input[1] == 1){ //Проверяем если число *-надцатое тогда добавляем десяток к 'единицам'
        input[2] += 10; 
    }

    let prima   = hundreds[ input[0] ]; //Первое слово
    let seconda = dozens[ input[1] ];   //Второе слово
    let terza   = units[ input[2] ];    //Третье слово
    
    let answer = prima + ' ' + (seconda ? seconda + ' ' : '') + terza;

    console.log(answer);
